<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => ':attribute должен быть принят.',
    'accepted_if' => 'сообщение на русском об ошибке валидации',
    'active_url' => 'сообщение на русском об ошибке валидации',
    'after' => 'сообщение на русском об ошибке валидации',
    'after_or_equal' => 'сообщение на русском об ошибке валидации',
    'alpha' => 'сообщение на русском об ошибке валидации',
    'alpha_dash' => 'сообщение на русском об ошибке валидации',
    'alpha_num' => 'сообщение на русском об ошибке валидации',
    'array' => 'сообщение на русском об ошибке валидации',
    'before' => 'сообщение на русском об ошибке валидации',
    'before_or_equal' => 'сообщение на русском об ошибке валидации',
    'between' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'boolean' => 'сообщение на русском об ошибке валидации',
    'confirmed' => 'сообщение на русском об ошибке валидации.',
    'current_password' => 'сообщение на русском об ошибке валидации',
    'date' => 'сообщение на русском об ошибке валидации',
    'date_equals' => 'сообщение на русском об ошибке валидации',
    'date_format' => 'сообщение на русском об ошибке валидации',
    'declined' => 'сообщение на русском об ошибке валидации',
    'declined_if' => 'сообщение на русском об ошибке валидации',
    'different' => 'сообщение на русском об ошибке валидации',
    'digits' => 'сообщение на русском об ошибке валидации',
    'digits_between' => 'сообщение на русском об ошибке валидации',
    'dimensions' => 'сообщение на русском об ошибке валидации',
    'distinct' => 'сообщение на русском об ошибке валидации',
    'doesnt_start_with' => 'сообщение на русском об ошибке валидации',
    'email' => 'сообщение на русском об ошибке валидации',
    'ends_with' => 'сообщение на русском об ошибке валидации',
    'enum' => 'сообщение на русском об ошибке валидации',
    'exists' => 'сообщение на русском об ошибке валидации',
    'file' => 'сообщение на русском об ошибке валидации',
    'filled' => 'сообщение на русском об ошибке валидации',
    'gt' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'gte' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'image' => 'сообщение на русском об ошибке валидации',
    'in' => 'сообщение на русском об ошибке валидации',
    'in_array' => 'сообщение на русском об ошибке валидации',
    'integer' => 'сообщение на русском об ошибке валидации',
    'ip' => 'сообщение на русском об ошибке валидации',
    'ipv4' => 'сообщение на русском об ошибке валидации',
    'ipv6' => 'сообщение на русском об ошибке валидации',
    'json' => 'сообщение на русском об ошибке валидации',
    'lt' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'lte' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'mac_address' => 'сообщение на русском об ошибке валидации',
    'max' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'mimes' => 'сообщение на русском об ошибке валидации',
    'mimetypes' => 'сообщение на русском об ошибке валидации',
    'min' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'multiple_of' => 'сообщение на русском об ошибке валидации',
    'not_in' => 'сообщение на русском об ошибке валидации',
    'not_regex' => 'сообщение на русском об ошибке валидации',
    'numeric' => 'сообщение на русском об ошибке валидации',
    'password' => [
        'letters' => 'сообщение на русском об ошибке валидации',
        'mixed' => 'сообщение на русском об ошибке валидации',
        'numbers' => 'сообщение на русском об ошибке валидации',
        'symbols' => 'сообщение на русском об ошибке валидации',
        'uncompromised' => 'сообщение на русском об ошибке валидации',
    ],
    'present' => 'сообщение на русском об ошибке валидации',
    'prohibited' => 'сообщение на русском об ошибке валидации',
    'prohibited_if' => 'сообщение на русском об ошибке валидации',
    'prohibited_unless' => 'сообщение на русском об ошибке валидации',
    'prohibits' => 'сообщение на русском об ошибке валидации',
    'regex' => 'The :attribute не валидный формат',
    'required' => 'сообщение на русском об ошибке валидации',
    'required_array_keys' => 'сообщение на русском об ошибке валидации',
    'required_if' => 'сообщение на русском об ошибке валидации',
    'required_unless' => 'сообщение на русском об ошибке валидации',
    'required_with' => 'сообщение на русском об ошибке валидации',
    'required_with_all' => 'сообщение на русском об ошибке валидации',
    'required_without' => 'сообщение на русском об ошибке валидации',
    'required_without_all' => 'сообщение на русском об ошибке валидации',
    'same' => 'сообщение на русском об ошибке валидации',
    'size' => [
        'array' => 'сообщение на русском об ошибке валидации',
        'file' => 'сообщение на русском об ошибке валидации',
        'numeric' => 'сообщение на русском об ошибке валидации',
        'string' => 'сообщение на русском об ошибке валидации',
    ],
    'starts_with' => 'сообщение на русском об ошибке валидации',
    'string' => 'сообщение на русском об ошибке валидации',
    'timezone' => 'сообщение на русском об ошибке валидации',
    'unique' => 'сообщение на русском об ошибке валидации',
    'uploaded' => 'сообщение на русском об ошибке валидации',
    'url' => 'сообщение на русском об ошибке валидации',
    'uuid' => 'сообщение на русском об ошибке валидации',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
